Cybernetics/cybernetics_sem.org
** Задача 2.3(4)
Представить в виде СДНФ функцию:
#+begin_export latex
\zall
\begin{equation}
f(\tilde{x}^3) = (01010001)
\end{equation}
#+end_export
*** Решение
    #+begin_export latex
Функция принимает единичные значения на наборах $001, 011$ и $111$, откуда СДНФ имеет вид:
\begin{equation}
f(\tilde{x}^3) = \overline{x_1}\overline{x_2}x_3\vee\overline{x_1}x_2x_3\vee x_1x_2x_3
\end{equation}
    #+end_export
** Задача 2.1(3)
Из множества $A$ ЭК выделить простые импликанты функции $f$:
#+begin_export latex
\begin{equation}
A = \{x_1, \overline{x_4}, x_2\overline{x_3}, \overline{x_1}\overline{x_2}\overline{x_4}\},
f(\tilde{x}^4) = (1010 1110 1101 1110)
\end{equation}
#+end_export
*** Решение
    #+begin_export latex
ЭК $x_1$ не является импликантой функции $f$, так как $f(1111) = 0$.

ЭК $\overline{x_4}$ является простой импликантой функции $f$.

ЭК $x_2\overline{x_3}$ является импликантой функции $f$. ЭК $x_2$ не является импликантой
функции $f$, так как $f(1111) = 0$. ЭК $\overline{x_3}$ также не является импликантой $f$,
так как $f(0001) = 0$, значит $x_2\overline{x_3}$ -- простая импликанта функции $f$.

ЭК $\overline{x_1}\overline{x_2}\overline{x_4}$ является импликантой функции $f$, но она не
является простой, так как содержит множитель $\overline{x_4}$, который, как было указано ранее,
является импликантой $f$.
    #+end_export
** Задача 2.5(2, 6)
Изобразив множество $N_f$ функции $f(\tilde{x}^n)$ в $B^n$, найти коды максимальных интервалов
и построить сокращённую ДНФ:
   #+begin_export latex
\begin{equation}
\tilde{\alpha}_f = (0101 0011)
\end{equation}
\begin{equation}
\tilde{\alpha}_f = (0001 0111 1110 1111)
\end{equation}
   #+end_export
*** Решение
Для первой функции находим две максимальные грани с кодами $(112)$ и $(021)$, попытки расширить
которые приводят к выходу из $N_f$. Отсюда получаем сокращённую ДНФ:
#+begin_export latex
\begin{equation}
f(\tilde{x}^3) = \overline{x_1}x_3\vee x_1x_2
\end{equation}
#+end_export
Для второй функции максимальные грани имеют коды $(2112)$, $(1202)$, $(0121)$ и $(0211)$.
Попытки расширить эти грани приводят к выходу из $N_f$. Отсюда получаем сокращённую ДНФ:
#+begin_export latex
\begin{equation}
f(\tilde{x}^4) = x_2x_3\vee x_1\overline{x_3}\vee\overline{x_1}x_2x_4\vee\overline{x_1}x_3x_4
\end{equation}
#+end_export
** Задача 2.6(2, 6)
Найти сокращённую ДНФ функции с помощью минимизирующей карты:
#+begin_export latex
\begin{equation}
\tilde{\alpha_f} = (1101 1011)
\end{equation}
\begin{equation}
\tilde{\alpha_f} = (0011 1101 1111 1101)
\end{equation}
#+end_export
Карта Карно для первой функции:
|------------------+----+----+----+----|
| $x_1$ \ $x_2x_3$ | 00 | 01 | 11 | 10 |
|------------------+----+----+----+----|
|                0 |  1 |  1 |  1 |  0 |
|                1 |  1 |  0 |  1 |  1 |
|------------------+----+----+----+----|
В данном случае максимальными по включению будут прямоугольники $(00-)$, $(-00)$, $(0-1)$,
$(-11)$, $(11-)$, $(1-0)$, откуда сокращённая ДНФ имеет вид:
#+begin_export latex
\begin{equation}
f(\tilde{x}^3) = \overline{x_1}\overline{x_2}\vee\overline{x_2}\overline{x_3}\vee\overline{x_1}x_3
\vee x_2x_3\vee x_1x_2\vee x_1\overline{x_3}
\end{equation}
#+end_export
Карта Карно для второй функции:
|---------------------+----+----+----+----|
| $x_1x_2$ \ $x_3x_4$ | 00 | 01 | 11 | 10 |
|---------------------+----+----+----+----|
|                  00 |  0 |  0 |  1 |  1 |
|                  01 |  1 |  1 |  1 |  0 |
|                  11 |  1 |  1 |  1 |  0 |
|                  10 |  1 |  1 |  1 |  1 |
|---------------------+----+----+----+----|
Максимальными по включению здесь будут прямоугольники $(10--), (-10-), (--11), (-010)$,
которые дают сокращённую ДНФ:
#+begin_export latex
\begin{equation}
f(\tilde{x}^4) = x_1\overline{x_2}\vee x_2\overline{x_3}\vee x_3x_4\vee\overline{x_2}x_3\overline{x_4}
\end{equation}
#+end_export
** Задача 2.2(3, 4)
По заданной ДНФ методом Блейка получить сокращённую ДНФ:
#+begin_export latex
\begin{equation}
D = x_1\vee\overline{x_1}x_2\vee\overline{x_1}\overline{x_2}x_3\vee\overline{x_1}x_2x_3x_4
\end{equation}
\begin{equation}
D = x_1\overline{x_2}x_4\vee\overline{x_1}\overline{x_2}x_3\vee\overline{x_3}\overline{x_4}
\end{equation}
#+end_export
*** Решение
#+begin_export latex
\begin{multline}
x_1\vee\overline{x_1}x_2\vee\overline{x_1}\overline{x_2}x_3\vee\overline{x_1}x_2x_3x_4 = \\
= x_1\vee\overline{x_1}x_2\vee\overline{x_1}\overline{x_2}x_3\vee\overline{x_1}x_2x_3x_4
\vee x_2\vee\overline{x_2}x_3\vee x_2x_3x_4\vee\overline{x_1}x_3\vee\overline{x_1}x_3x_4 = \\
= x_1\vee x_2\vee\overline{x_1}x_3\vee\overline{x_2}x_3\vee
= x_1\vee x_2\vee\overline{x_1}x_3\vee\overline{x_2}x_3\vee x_3
= x_1\vee x_2\vee x_3
\end{multline}
\begin{multline}
x_1\overline{x_2}x_4\vee\overline{x_1}\overline{x_2}x_3\vee\overline{x_3}\overline{x_4}
= x_1\overline{x_2}x_4\vee\overline{x_1}\overline{x_2}x_3\vee\overline{x_3}\overline{x_4}\vee
\overline{x_2}x_3x_4\vee\overline{x_1}\overline{x_2}\overline{x_4}\vee x_1\overline{x_2}\overline{x_3} = \\
= x_1\overline{x_2}x_4\vee\overline{x_1}\overline{x_2}x_3\vee\overline{x_3}\overline{x_4}\vee
\overline{x_2}x_3x_4\vee\overline{x_1}\overline{x_2}\overline{x_4}\vee x_1\overline{x_2}\overline{x_3}\vee
\overline{x_2}\overline{x_3}\overline{x_4}\vee x_1\overline{x_2}x_4\vee\overline{x_1}\overline{x_2}x_3 = \\
= x_1\overline{x_2}x_4\vee\overline{x_1}\overline{x_2}x_3\vee\overline{x_3}\overline{x_4}
\vee\overline{x_2}x_3x_4\vee\overline{x_1}\overline{x_2}\overline{x_4}\vee x_1\overline{x_2}\overline{x_3}
\end{multline}
#+end_export
** Задача 2.3(3, 4)
Построить сокращённую ДНФ по заданной КНФ:
#+begin_export latex
\begin{equation}
(x_1\vee\overline{x_2}\vee\overline{x_3})(\overline{x_1}\vee x_2)(x_1\vee x_2\vee x_3)
\end{equation}
\begin{equation}
(x_1\vee x_2\vee x_3)(\overline{x_1}\vee\overline{x_2}\vee\overline{x_3})
\end{equation}
#+end_export
*** Решение
    #+begin_export latex
\begin{multline}
(x_1\vee\overline{x_2}\vee\overline{x_3})(\overline{x_1}\vee x_2)(x_1\vee x_2\vee x_3) =
(x_1x_2\vee\overline{x_1}\overline{x_2}\vee\overline{x_1}\overline{x_3}\vee x_2\overline{x_3})
(x_1\vee x_2\vee x_3) = \\
= x_1x_2\vee x_1x_2x_3\vee\overline{x_1}\overline{x_2}x_3\vee\overline{x_1}x_2\overline{x_3}\vee
x_1x_2\overline{x_3}\vee x_2\overline{x_3} = x_1x_2\vee x_2\overline{x_3}\vee\overline{x_1}\overline{x_2}x_3
\end{multline}
\begin{equation}
(x_1\vee x_2\vee x_3)(\overline{x_1}\vee\overline{x_2}\vee\overline{x_3})
= x_1\overline{x_2}\vee x_1\overline{x_3}\vee\overline{x_1}x_2\vee x_2\overline{x_3}\vee
\overline{x_1}x_3\vee\overline{x_2}x_3
\end{equation}
    #+end_export
** Задача 2.9(6)
Найти длину сокращённой ДНФ функции $f$:
#+begin_export latex
\begin{equation}
f(\tilde{x}^n) = (x_1\vee\ldots\vee x_n)(x_1\vee\ldots\vee x_k\vee\overline{x}_{k + 1}\vee\ldots\vee\overline{x}_n)
\end{equation}
#+end_export
*** Решение
    #+begin_export latex
\begin{multline}
(x_1\vee\ldots\vee x_n)(x_1\vee\ldots\vee x_k\vee\overline{x}_{k + 1}\vee\ldots\overline{x}_n) =
(\vee_{i = 1}^kx_k)\vee(\vee_{i, j = 1}^{k, n}x_ix_j)\vee(\vee_{i = k + 1, j = 1}^{n}\overline{x}_ix_j) = \\
= (\vee_{i = 1}^kx_k)\vee(\vee_{i, j = k + 1}^n\overline{x_i}x_j)\vee(\vee_{i, j = k + 1}^nx_ix_j)
\end{multline}
Всего получаем
\begin{equation}
k + 2\frac{(n - k)(n - k + 1)}2 = k + (n - k)(n - k + 1) = n + (n - k)^2 = n^2 - 2nk + n + k^2
\end{equation}
слагаемых.
    #+end_export
* Семинар 2
** Задача 3.1(1, 5)
   #+begin_export latex
\zall
\begin{equation}
   D = x_1x_2 \vee\overline{x_1}\text{ - не тупиковая, не минимальная, кратчайшая.}
\end{equation}
\begin{equation}
   D = x_1x_2x_3\vee\overline{x_2}x_3\vee x_2\overline{x_3}\text{ - не тупиковая, не минимальная, кратчайшая.}
\end{equation}
   #+end_export
** Задача 3.3(1)
   Построить ядро, ДНФ Квайна, ДНФ $\Sigma T$ по сокращённой ДНФ:
   #+begin_export latex
   \begin{equation}
D_f = xy\vee\overline{x}\overline{z}\vee y\overline{z}
   \end{equation}
   #+end_export
