Cybernetics/cybernetics_sem.tex
\subsection{Задача 3.3(1)}
\label{sec:org0912121}
Построить ядро, ДНФ Квайна, ДНФ \(\Sigma T\) по сокращённой ДНФ:
   \begin{equation}
D_f = xy\vee\overline{x}\overline{z}\vee y\overline{z}
   \end{equation}
\subsubsection{Решение}
\label{sec:org93ea01d}
Таблица Квайна:
\begin{center}
\begin{tabular}{lrlrlllrrl}
\hline
 & 000 & 001 & 010 & 011 & 100 & 101 & 110 & 111 & \\
\hline
\(xy\) &  & x &  & x & x & x & 1 & 1 & я\\
\(\overline{x}\overline{z}\) & 1 & x & 1 & x & x & x &  &  & я\\
\(y\overline{z}\) &  & x & 1 & x & x & x & 1 &  & пя, р\\
\hline
\end{tabular}
\end{center}
000 и 111 - ядровые грани, 010 и 110 покрыты ядром => \(y\overline{z}\) покрыта ядром.
Ядро: \(\{N_{xy}, N_{\overline{x}\overline{z}}\}\)
ДНФ Квайна: \(D_f = xy\vee\overline{x}\overline{z}\)
Точки 010 и 110 регулярны, поэтому ДНФ \(\Sigma T\) совпадает с ДНФ Квайна.
\subsection{Задача 3.3(2)}
\label{sec:orgf18d489}
Построить ядро, ДНФ Квайна, ДНФ \(\Sigma t\):
   \begin{equation}
D = \overline{z}\overline{w}\vee\overline{y}zw\vee x\overline{y}w\vee \overline{x}\overline{y}z
\vee x\overline{y}\overline{z}\vee\overline{x}\overline{y}\overline{w}
   \end{equation}
\subsubsection{Решение}
\label{sec:org486e1e6}
Таблица Квайна:
\begin{center}
\begin{tabular}{lrlrrrlllrrlrrlll}
\hline
 & 0000 & 0001 & 0010 & 0011 & 0100 & 0101 & 0110 & 0111 & 1000 & 1001 & 1010 & 1011 & 1100 & 1101 & 1110 & 1111\\
\hline
\(\overline{z}\overline{w}\) & 1 & x &  &  & 1 & x & x & x & 1 &  & x &  & 1 & x & x & x\\
\(\overline{y}zw\) &  & x &  & 1 &  & x & x & x &  &  & x & 1 &  & x & x & x\\
\(x\overline{y}w\) &  & x &  &  &  & x & x & x &  & 1 & x & 1 &  & x & x & x\\
\(\overline{x}\overline{y}z\) &  & x & 1 & 1 &  & x & x & x &  &  & x &  &  & x & x & x\\
\(x\overline{y}\overline{z}\) &  & x &  &  &  & x & x & x & 1 & 1 & x &  &  & x & x & x\\
\(\overline{x}\overline{y}\overline{w}\) & 1 & x & 1 &  &  & x & x & x &  &  & x &  &  & x & x & x\\
\hline
\end{tabular}
\end{center}
Точки 0100 и 1100 ядровые, точки 0000 и 1000 покрыты ядром и регулярны, откуда ядро: \(\{N_{\overline{z}\overline{w}}\}\),
и ДНФ Квайна совпадает с ДНФ \(\Sigma T\) и равна исходной.
\subsection{Задача 3.4(3)}
\label{sec:orgacade00}
   \begin{equation}
D_f = \overline{x}w\vee\overline{y}w\vee zw\vee xz\vee yz
   \end{equation}
\subsubsection{Решение}
\label{sec:org8e83afa}
Таблица Квайна:
\begin{center}
\begin{tabular}{llrlrlrrrlrrrlrrr}
\hline
 & 0000 & 0001 & 0010 & 0011 & 0100 & 0101 & 0110 & 0111 & 1000 & 1001 & 1010 & 1011 & 1100 & 1101 & 1110 & 1111\\
\hline
\(\overline{x}w\) & x & 1 & x & 1 & x & 1 &  & 1 & x &  &  &  & x &  &  & \\
\(\overline{y}w\) & x & 1 & x & 1 & x &  &  &  & x & 1 &  & 1 & x &  &  & \\
\(zw\) & x &  & x & 1 & x &  &  & 1 & x &  &  & 1 & x &  &  & 1\\
\(xz\) & x &  & x &  & x &  &  &  & x &  & 1 & 1 & x & 1 & 1 & \\
\(yz\) & x &  & x &  & x &  & 1 & 1 & x &  &  &  & x &  & 1 & 1\\
\hline
\end{tabular}
\end{center}
Точки 0101, 0110, 1001, 1010 ядровые, 0001, 0011, 0111, 1011, 1110, 1111 покрыты ядром и регулярны,
соответственно, ДНФ \(\Sigma M\), ДНФ \(\Sigma T\) и ДНФ Квайна совпадают и равны:
\begin{equation}
D_f = \overline{x}w\vee\overline{y}w\vee xz\vee yz
\end{equation}
\subsection{Задача 3.6(1)}
\label{sec:orgd1046b5}
Построить все тупиковые ДНФ функции
\begin{equation}
\tilde{\alpha}_f = (01111100)
\end{equation}
\subsubsection{Решение}
\label{sec:orga9048b5}
Карта Карно:
\begin{center}
\begin{tabular}{rrr}
\hline
\(xy\backslash w\) & 0 & 1\\
\hline
00 & 0 & 1\\
01 & 1 & 1\\
11 & 0 & 0\\
10 & 1 & 1\\
\hline
\end{tabular}
\end{center}
Отсюда получаем \(\overline{x}w\vee\overline{x}y\vee x\overline{y}\vee\overline{y}w\). Таблица
Квайна:
\begin{center}
\begin{tabular}{lrrrrrl}
\hline
 & 001 & 010 & 011 & 100 & 101 & \\
\hline
\(K_1 = \overline{x}w\) & 1 &  & 1 &  &  & \\
\(K_2 = \overline{x}y\) &  & 1 & 1 &  &  & я\\
\(K_3 = x\overline{y}\) &  &  &  & 1 & 1 & я\\
\(K_4 = \overline{y}w\) & 1 &  &  &  & 1 & \\
\hline
\end{tabular}
\end{center}
Точки 010 и 100 ядровые, точки 011 и 101 покрыты ядром.
\begin{equation}
(K_1\vee K_4)\cdot K_2\cdot K_3 = K_1K_2K_3\vee K_2K_3K_4
\end{equation}
Все тупиковые ДНФ:
\begin{equation}
\overline{x}w\vee\overline{x}y\vee x\overline{y}
\end{equation}
\begin{equation}
\overline{x}y\vee x\overline{y}\vee\overline{y}w
\end{equation}
\subsection{Задача 3.6(4)}
\label{sec:org38d2537}
   \begin{equation}
\tilde{\alpha}_f = (1111 1000 0100 1100)
   \end{equation}
\subsubsection{Решение}
\label{sec:org6b01b7f}
Карта Карно:
\begin{center}
\begin{tabular}{rrrrr}
\hline
\(xy\backslash zw\) & 00 & 01 & 11 & 10\\
\hline
00 & 1 & 1 & 1 & 1\\
01 & 1 & 0 & 0 & 0\\
11 & 1 & 1 & 0 & 0\\
10 & 0 & 1 & 0 & 0\\
\hline
\end{tabular}
\end{center}
Получаем сокращённую ДНФ:
\begin{equation}
\overline{x}\overline{y}\vee\overline{x}\overline{z}\overline{w}
\vee xy\overline{z}\vee x\overline{z}w\vee \overline{y}\overline{z}w
\end{equation}
Таблица Квайна:
\begin{center}
\begin{tabular}{lrrrrrrrrl}
\hline
 & 0000 & 0001 & 0010 & 0011 & 0100 & 1001 & 1100 & 1101 & \\
\hline
\(K_1 = \overline{x}\overline{y}\) & 1 & 1 & 1 & 1 &  &  &  &  & я\\
\(K_2 = \overline{x}\overline{z}\overline{w}\) & 1 &  &  &  & 1 &  &  &  & \\
\(K_3 = y\overline{z}\overline{w}\) &  &  &  &  & 1 &  & 1 &  & \\
\(K_4 = xy\overline{z}\) &  &  &  &  &  &  & 1 & 1 & \\
\(K_5 = x\overline{z}w\) &  &  &  &  &  & 1 &  & 1 & \\
\(K_6 = \overline{y}\overline{z}w\) &  & 1 &  &  &  & 1 &  &  & \\
\hline
\end{tabular}
\end{center}
Ядровые точки 0010 и 0011, точки 0000 и 0001 покрыты ядром.
Функция покрытия для оставшейся таблицы:
\begin{equation}
(K_2\vee K_3)(K_5\vee K_6)(K_3\vee K_4)(K_4\vee K_5) =
(K_3\vee K_2K_4)(K_5\vee K_4K_6) =
K_3K_5\vee K_3K_4K_6\vee K_2K_4K_5\vee K_2K_4K_6
\end{equation}
Получаем 4 тупиковых ДНФ:
\begin{equation}
\overline{x}\overline{y}\vee y\overline{z}\overline{w}\vee x\overline{z}w,
\end{equation}
\begin{equation}
\overline{x}\overline{y}\vee y\overline{z}\overline{w}\vee xy\overline{z}\vee\overline{y}\overline{z}w,
\end{equation}
\begin{equation}
\overline{x}\overline{y}\vee \overline{x}\overline{z}\overline{w}\vee xy\overline{z}\vee x\overline{z}w,
\end{equation}
\begin{equation}
\overline{x}\overline{y}\vee\overline{x}\overline{z}\overline{w}\vee xy\overline{z}\vee \overline{y}\overline{z}w
\end{equation}
\section{Домашняя работа 2}
\label{sec:org3d797e2}
\subsection{Задача 3.1(4, 6)}
\label{sec:org7ded8dd}
Выяснить, является ли ДНФ D тупиковой, кратчайшей, минимальной:
\zall
\begin{equation}
D = x_1\overline{x}_2 \vee \overline{x}_1x_2
\end{equation}
\begin{equation}
D = x_1x_2 \vee \overline{x}_1x_3\overline{x}_4 \vee \overline{x}_2x_3x_4
\end{equation}
\subsubsection{Решение}
\label{sec:org15d64e6}
4) $D$ является тупиковой, кратчайшей и минимальной.\\
6) $D$ является тупиковой, кратчайшей и минимальной.
