Cybernetics/cybernetics_sem.org
** Задача 3.3(3, 4 -- ядро, ДНФ Квайна и \Sigma T)
Построить ядро, ДНФ Квайна и $\Sigma T$ по сокращённой ДНФ:
   #+begin_export latex
   \begin{equation}
D = x\overline{y}z \vee x\overline{y}\overline{w} \vee \overline{x}y\overline{w} \vee
\overline{x}\overline{z}\overline{w} \vee \overline{y}\overline{z}\overline{w}
   \end{equation}
\begin{equation}
D = \overline{z}\overline{w} \vee \overline{x}\overline{y}\overline{w} \vee
\overline{x}\overline{y}\overline{z} \vee xyz \vee xy\overline{w}
\end{equation}
   #+end_export
*** Решение
Строим таблицу Квайна:
|----------------------------------------+------+------+------+------+------+------+------+------+------+------+------+------+------+------+------+------+------|
|                                        | 0000 | 0001 | 0010 | 0011 | 0100 | 0101 | 0110 | 0111 | 1000 | 1001 | 1010 | 1011 | 1100 | 1101 | 1110 | 1111 |      |
|----------------------------------------+------+------+------+------+------+------+------+------+------+------+------+------+------+------+------+------+------|
| $x\overline{y}z$                       |      | x    | x    | x    |      | x    |      |      |      | x    |    1 |    1 | x    | x    | x    |      | я    |
| $x\overline{y}\overline{w}$            |      | x    | x    | x    |      | x    |      |      |    1 | x    |    1 |      | x    | x    | x    |      | я    |
| $\overline{x}y\overline{w}$            |      | x    | x    | x    |    1 | x    |    1 |      |      | x    |      |      | x    | x    | x    |      | я    |
| $\overline{x}\overline{z}\overline{w}$ |    1 | x    | x    | x    |    1 | x    |      |      |      | x    |      |      | x    | x    | x    |      | я    |
| $\overline{y}\overline{z}\overline{w}$ |      | x    | x    | x    |      | x    |      |    1 |      | x    |      |      | x    | x    | x    |    1 | я    |
|----------------------------------------+------+------+------+------+------+------+------+------+------+------+------+------+------+------+------+------+------|
|                                        |    я |      |      |      |    р |      |    я |    я |    я |      |    р |    я |      |      |      |    я |      |
|----------------------------------------+------+------+------+------+------+------+------+------+------+------+------+------+------+------+------+------+------|
Таким образом, ядро: $\{N_{x\overline{y}z}, N_{x\overline{y}\overline{w}}, N_{\overline{x}y\overline{w}}, N_{\overline{x}\overline{z}\overline{w}}, N_{\overline{y}\overline{z}\overline{w}}\}$,
соответственно, ДНФ Квайна и ДНФ $\Sigma T$ совпадают с ДНФ $(3)$

Таблица Квайна для второй ДНФ(наборы, где все слагаемые обращаются в ноль, опущены для краткости):
|----------------------------------------+------+------+------+------+------+------+------+------+------+------|
|                                        | 0000 | 0001 | 0010 | 0100 | 1000 | 1100 | 1101 | 1110 | 1111 |      |
|----------------------------------------+------+------+------+------+------+------+------+------+------+------|
| $\overline{z}\overline{w}$             |    1 |      |      |    1 |    1 |    1 |      |      |      | я    |
| $\overline{x}\overline{y}\overline{w}$ |    1 |      |    1 |      |      |      |      |      |      | я    |
| $\overline{x}\overline{y}\overline{z}$ |    1 |    1 |      |      |      |      |      |      |      | я    |
| $xyz$                                  |      |      |      |      |      |      |      |    1 |    1 | я    |
| $xy\overline{w}$                       |      |      |      |      |      |      |    1 |      |    1 | я    |
|----------------------------------------+------+------+------+------+------+------+------+------+------+------|
|                                        |    р |    я |    я |    я |    я |    я |    я |    я |    р |      |
|----------------------------------------+------+------+------+------+------+------+------+------+------+------|
Таким образом, ядро: $\{N_{\overline{z}\overline{w}}, N_{\overline{x}\overline{y}\overline{w}}, N_{\overline{x}\overline{y}\overline{z}}, N_{xyz}, N_{xy\overline{w}}\}$.
Соответственно, ДНФ Квайна и ДНФ $\Sigma T$ совпадают с (4)
** Задача 3.4(4)
По сокращённой ДНФ построить ДНФ $\Sigma M$:
#+begin_export latex
\begin{equation}
D = \overline{x}z \vee yz \vee \overline{x}\overline{y}w \vee xy \vee \overline{y}zw \vee xzw
\end{equation}
#+end_export
*** Решение
Таблица Квайна:
|-----------------------------+------+------+-------+-------+-------+------+------+------+-------+-------+----|
|                             | 0001 | 0010 |  0011 |  0110 |  0111 | 1011 | 1100 | 1101 |  1110 |  1111 |    |
|-----------------------------+------+------+-------+-------+-------+------+------+------+-------+-------+----|
| $\overline{x}z$             |      |    1 |     1 |     1 |     1 |      |      |      |       |       | я  |
| $yz$                        |      |      |       |     1 |     1 |      |      |      |     1 |     1 | пя |
| $\overline{x}\overline{y}w$ |    1 |      |     1 |       |       |      |      |      |       |       | я  |
| $xy$                        |      |      |       |       |       |      |    1 |    1 |     1 |     1 | я  |
| $\overline{y}zw$            |      |      |     1 |       |       |    1 |      |      |       |       |    |
| $xzw$                       |      |      |       |       |       |    1 |      |      |       |     1 |    |
|-----------------------------+------+------+-------+-------+-------+------+------+------+-------+-------+----|
|                             |    я |    я | пя, р | пя, р | пя, р |      |    я |    я | пя, р | пя, р |    |
|-----------------------------+------+------+-------+-------+-------+------+------+------+-------+-------+----|
Получаем две тупиковые ДНФ:
#+begin_export latex
\begin{equation}
D_1 = \overline{x}z \vee \overline{x}\overline{y}w \vee xy \vee \overline{y}zw
\end{equation}
и
\begin{equation}
D_2 = \overline{x}z \vee \overline{x}\overline{y}w \vee xy \vee xzw
\end{equation}
Обе ДНФ являются минимальными, поэтому ДНФ $\Sigma M$ имеет вид:
\begin{equation}
D = \overline{x}z \vee yz \vee \overline{x}\overline{y}w \vee xy \vee \overline{y}zw \vee xzw
\end{equation}
#+end_export
** Задача 3.6(3, 6, 8)
С помощью таблицы Квайна построить все тупиковые ДНФ функции:
#+begin_export latex
\begin{equation}
\tilde{\alpha}_f = (0001 1111)
\end{equation}
\begin{equation}
\tilde{\alpha}_f = (1110 0110 0001 0101)
\end{equation}
\begin{equation}
\tilde{\alpha}_f = (0001 1011 1110 0111)
\end{equation}
#+end_export
