Cybernetics/cybernetics_sem.tex
\subsection{Задача 3.3(3, 4 -- ядро, ДНФ Квайна и \(\Sigma\) T)}
\label{sec:org16be2cf}
Построить ядро, ДНФ Квайна и \(\Sigma T\) по сокращённой ДНФ:
   \begin{equation}
D = x\overline{y}z \vee x\overline{y}\overline{w} \vee \overline{x}y\overline{w} \vee
\overline{x}\overline{z}\overline{w} \vee \overline{y}\overline{z}\overline{w}
   \end{equation}
\begin{equation}
D = \overline{z}\overline{w} \vee \overline{x}\overline{y}\overline{w} \vee
\overline{x}\overline{y}\overline{z} \vee xyz \vee xy\overline{w}
\end{equation}
\subsubsection{Решение}
\label{sec:orgd438d0c}
Строим таблицу Квайна:
\begin{center}
\begin{tabular}{lrlllrlrrrlrrlllrl}
\hline
 & 0000 & 0001 & 0010 & 0011 & 0100 & 0101 & 0110 & 0111 & 1000 & 1001 & 1010 & 1011 & 1100 & 1101 & 1110 & 1111 & \\
\hline
\(x\overline{y}z\) &  & x & x & x &  & x &  &  &  & x & 1 & 1 & x & x & x &  & я\\
\(x\overline{y}\overline{w}\) &  & x & x & x &  & x &  &  & 1 & x & 1 &  & x & x & x &  & я\\
\(\overline{x}y\overline{w}\) &  & x & x & x & 1 & x & 1 &  &  & x &  &  & x & x & x &  & я\\
\(\overline{x}\overline{z}\overline{w}\) & 1 & x & x & x & 1 & x &  &  &  & x &  &  & x & x & x &  & я\\
\(\overline{y}\overline{z}\overline{w}\) &  & x & x & x &  & x &  & 1 &  & x &  &  & x & x & x & 1 & я\\
\hline
 & я &  &  &  & р &  & я & я & я &  & р & я &  &  &  & я & \\
\hline
\end{tabular}
\end{center}
Таким образом, ядро: \(\{N_{x\overline{y}z}, N_{x\overline{y}\overline{w}}, N_{\overline{x}y\overline{w}}, N_{\overline{x}\overline{z}\overline{w}}, N_{\overline{y}\overline{z}\overline{w}}\}\),
соответственно, ДНФ Квайна и ДНФ \(\Sigma T\) совпадают с ДНФ \((3)\)

Таблица Квайна для второй ДНФ(наборы, где все слагаемые обращаются в ноль, опущены для краткости):
\begin{center}
\begin{tabular}{lrrrrrrrrrl}
\hline
 & 0000 & 0001 & 0010 & 0100 & 1000 & 1100 & 1101 & 1110 & 1111 & \\
\hline
\(\overline{z}\overline{w}\) & 1 &  &  & 1 & 1 & 1 &  &  &  & я\\
\(\overline{x}\overline{y}\overline{w}\) & 1 &  & 1 &  &  &  &  &  &  & я\\
\(\overline{x}\overline{y}\overline{z}\) & 1 & 1 &  &  &  &  &  &  &  & я\\
\(xyz\) &  &  &  &  &  &  &  & 1 & 1 & я\\
\(xy\overline{w}\) &  &  &  &  &  &  & 1 &  & 1 & я\\
\hline
 & р & я & я & я & я & я & я & я & р & \\
\hline
\end{tabular}
\end{center}
Таким образом, ядро: \(\{N_{\overline{z}\overline{w}}, N_{\overline{x}\overline{y}\overline{w}}, N_{\overline{x}\overline{y}\overline{z}}, N_{xyz}, N_{xy\overline{w}}\}\).
Соответственно, ДНФ Квайна и ДНФ \(\Sigma T\) совпадают с (4)
\subsection{Задача 3.4(4)}
\label{sec:orgc08eacf}
По сокращённой ДНФ построить ДНФ \(\Sigma M\):
\begin{equation}
D = \overline{x}z \vee yz \vee \overline{x}\overline{y}w \vee xy \vee \overline{y}zw \vee xzw
\end{equation}
\subsubsection{Решение}
\label{sec:org3ee0695}
Таблица Квайна:
\begin{center}
\begin{tabular}{lrrrrrrrrrrl}
\hline
 & 0001 & 0010 & 0011 & 0110 & 0111 & 1011 & 1100 & 1101 & 1110 & 1111 & \\
\hline
\(\overline{x}z\) &  & 1 & 1 & 1 & 1 &  &  &  &  &  & я\\
\(yz\) &  &  &  & 1 & 1 &  &  &  & 1 & 1 & пя\\
\(\overline{x}\overline{y}w\) & 1 &  & 1 &  &  &  &  &  &  &  & я\\
\(xy\) &  &  &  &  &  &  & 1 & 1 & 1 & 1 & я\\
\(\overline{y}zw\) &  &  & 1 &  &  & 1 &  &  &  &  & \\
\(xzw\) &  &  &  &  &  & 1 &  &  &  & 1 & \\
\hline
 & я & я & пя, р & пя, р & пя, р &  & я & я & пя, р & пя, р & \\
\hline
\end{tabular}
\end{center}
Получаем две тупиковые ДНФ:
\begin{equation}
D_1 = \overline{x}z \vee \overline{x}\overline{y}w \vee xy \vee \overline{y}zw
\end{equation}
и
\begin{equation}
D_2 = \overline{x}z \vee \overline{x}\overline{y}w \vee xy \vee xzw
\end{equation}
Обе ДНФ являются минимальными, поэтому ДНФ $\Sigma M$ имеет вид:
\begin{equation}
D = \overline{x}z \vee yz \vee \overline{x}\overline{y}w \vee xy \vee \overline{y}zw \vee xzw
\end{equation}
\subsection{Задача 3.6(3, 6, 8)}
\label{sec:org2554122}
С помощью таблицы Квайна построить все тупиковые ДНФ функции:
\begin{equation}
\tilde{\alpha}_f = (0001 1111)
\end{equation}
\begin{equation}
\tilde{\alpha}_f = (1110 0110 0001 0101)
\end{equation}
\begin{equation}
\tilde{\alpha}_f = (0001 1011 1110 0111)
\end{equation}
