Cybernetics/cybernetics_sem.org
*** Решение
Карта Карно:
|------------------+---+---|
| $xy\backslash z$ | 0 | 1 |
|------------------+---+---|
|               00 |   |   |
|               01 |   | 1 |
|               11 | 1 | 1 |
|               10 | 1 | 1 |
|------------------+---+---|
Получаем сокращённую ДНФ:
#+begin_export latex
\begin{equation}
D = x \vee yz
\end{equation}
#+end_export
Строим таблицу Квайна:
|------------+-----+-------+-----+-----+-----+---|
|            | 011 |   100 | 101 | 110 | 111 |   |
|------------+-----+-------+-----+-----+-----+---|
| $K_1 = x$  |     |     1 |   1 |   1 |   1 | я |
| $K_2 = yz$ |   1 |     1 |     |     |     | я |
|------------+-----+-------+-----+-----+-----+---|
|            |   я | пя, р |   я |   я |   я |   |
|------------+-----+-------+-----+-----+-----+---|
Получили, что все грани ядровые, т. е. единственной тупиковой днф является (10).

Карта Карно для (10)
|-------------------+----+----+----+----|
| $xy\backslash zw$ | 00 | 01 | 11 | 10 |
|-------------------+----+----+----+----|
|                00 |  1 |  1 |    |  1 |
|                01 |    |  1 |    |  1 |
|                11 |    |  1 |  1 |    |
|                10 |    |    |  1 |    |
|-------------------+----+----+----+----|
Получаем сокращённую ДНФ:
#+begin_export latex
\begin{equation}
D = \overline{x}\overline{y}\overline{z} \vee \overline{x}\overline{z}w \vee y\overline{z}w \vee
xyw \vee xzw \vee \overline{x}z\overline{w} \vee \overline{x}\overline{y}\overline{w}
\end{equation}
#+end_export
Таблица Квайна:
|----------------------------------------------+------+------+------+------+------+------+------+------+---|
|                                              | 0000 | 0001 | 0010 | 0101 | 0110 | 1011 | 1101 | 1111 |   |
|----------------------------------------------+------+------+------+------+------+------+------+------+---|
| $K_1 = \overline{x}\overline{y}\overline{z}$ |    1 |    1 |      |      |      |      |      |      |   |
| $K_2 = \overline{x}\overline{z}w$            |      |    1 |      |    1 |      |      |      |      |   |
| $K_3 = y\overline{z}w$                       |      |      |      |    1 |      |      |    1 |      |   |
| $K_4 = xyw$                                  |      |      |      |      |      |      |    1 |    1 |   |
| $K_5 = xzw$                                  |      |      |      |      |      |    1 |      |    1 | я |
| $K_6 = \overline{x}z\overline{w}$            |      |      |    1 |      |    1 |      |      |      | я |
| $K_7 = \overline{x}\overline{y}\overline{w}$ |    1 |      |    1 |      |      |      |      |      |   |
|----------------------------------------------+------+------+------+------+------+------+------+------+---|
|                                              |      |      |   пя |      |    я |    я |      |   пя |   |
|----------------------------------------------+------+------+------+------+------+------+------+------+---|
Построим покрытие таблицы:
#+begin_export latex
\begin{multline}
(K_1 \vee K_7)(K_1 \vee K_2)(K_2 \vee K_3)(K_3 \vee K_4)K_5K_6 = (K_1 \vee K_2K_7)(K_3 \vee K_2K_4)K_5K_6 = \\
= K_1K_3K_5K_6 \vee K_1K_2K_4K_5K_6 \vee K_2K_3K_5K_6K_7 \vee K_2K_4K_5K_6K_7
\end{multline}
Откуда получаем 4 тупиковых ДНФ:
\begin{equation}
D_1 = \overline{x}\overline{y}\overline{z} \vee y\overline{z}w \vee xzw \vee \overline{x}z\overline{w}
\end{equation}
\begin{equation}
D_2 = \overline{x}\overline{y}\overline{z} \vee \overline{x}\overline{z}w \vee xzw \vee
\overline{x}z\overline{w} \vee \overline{x}\overline{y}\overline{w}
\end{equation}
\begin{equation}
D_3 = \overline{x}\overline{z}w \vee y\overline{z}w \vee xzw \vee \overline{x}z\overline{w} \vee
\overline{x}\overline{y}\overline{w}
\end{equation}
\begin{equation}
D_4 = \overline{x}\overline{z}w \vee xyw \vee xzw \vee \overline{x}z\overline{w} \vee
\overline{x}\overline{y}\overline{w}
\end{equation}
#+end_export

Карта Карно для (11):
|-------------------+----+----+----+----|
| $xy\backslash zw$ | 00 | 01 | 11 | 10 |
|-------------------+----+----+----+----|
|                00 |    |    |  1 |    |
|                01 |  1 |    |  1 |  1 |
|                11 |  1 |  1 |    |  1 |
|                10 |    |  1 |  1 |  1 |
|-------------------+----+----+----+----|
Получаем сокращённую ДНФ:
#+begin_export latex
\begin{equation}
D = y\overline{w} \vee xy\overline{z} \vee x\overline{z}w \vee x\overline{y}w \vee
x\overline{y}z \vee xz\overline{w} \vee \overline{x}yz \vee \overline{x}zw
\end{equation}
#+end_export
Таблица Квайна:
|------------------------+------+------+------+------+------+------+------+------+------+------+----|
|                        | 0011 | 0100 | 0110 | 0111 | 1001 | 1010 | 1011 | 1100 | 1101 | 1110 |    |
|------------------------+------+------+------+------+------+------+------+------+------+------+----|
| $K_1 = y\overline{w}$  |      |    1 |    1 |      |      |      |      |    1 |      |    1 | я  |
| $K_2 = xy\overline{z}$ |      |      |      |      |      |      |      |    1 |    1 |      |    |
| $K_3 = x\overline{z}w$ |      |      |      |      |    1 |      |      |      |    1 |      |    |
| $K_4 = x\overline{y}w$ |      |      |      |      |    1 |      |    1 |      |      |      |    |
| $K_5 = x\overline{y}z$ |      |      |      |      |      |    1 |    1 |      |      |      |    |
| $K_6 = xz\overline{w}$ |      |      |      |      |      |    1 |      |      |      |    1 |    |
| $K_7 = \overline{x}yz$ |      |      |    1 |    1 |      |      |      |      |      |      | пя |
| $K_8 = \overline{x}zw$ |    1 |      |      |    1 |      |      |      |      |      |      | я  |
|------------------------+------+------+------+------+------+------+------+------+------+------+----|
|                        |    я |    я |   пя |   пя |      |      |      |   пя |      |   пя |    |
|------------------------+------+------+------+------+------+------+------+------+------+------+----|
Покрытие таблицы:
#+begin_export latex
\begin{multline}
(K_3 \vee K_4)(K_5 \vee K_6)(K_4 \vee K_5)(K_2 \vee K_3)K_1K_8 = (K_3 \vee K_2K_4)(K_5 \vee K_6K_4)K_1K_8 = \\
= K_1K_3K_5K_8 \vee K_1K_2K_4K_5K_8 \vee K_1K_3K_4K_6K_8 \vee K_1K_2K_4K_6K_8
\end{multline}
Получаем 4 тупиковых ДНФ:
\begin{equation}
D_1 = y\overline{w} \vee x\overline{z}w \vee x\overline{y}z \vee \overline{x}zw
\end{equation}
\begin{equation}
D_2 = y\overline{w} \vee xy\overline{z} \vee x\overline{y}w \vee x\overline{y}z \vee \overline{x}zw
\end{equation}
\begin{equation}
D_3 = y\overline{w} \vee x\overline{z}w \vee xz\overline{w} \vee \overline{x}zw
\end{equation}
\begin{equation}
D_4 = y\overline{w} \vee xy\overline{z} \vee x\overline{y}w \vee xz\overline{w} \vee \overline{x}zw
\end{equation}
#+end_export
